platformio/platform-ststm32/misc/svd/STM32WB55_CM4.svd
            <register>
               <name>OPTR</name>
               <displayName>OPTR</displayName>
               <description>Flash option register</description>
               <addressOffset>0x20</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x10708000</resetValue>
               <fields>
                  <field>
                     <name>RDP</name>
                     <description>Read protection level</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>ESE</name>
                     <description>Security enabled</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BOR_LEV</name>
                     <description>BOR reset Level</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>nRST_STOP</name>
                     <description>nRST_STOP</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>nRST_STDBY</name>
                     <description>nRST_STDBY</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>nRST_SHDW</name>
                     <description>nRST_SHDW</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IDWG_SW</name>
                     <description>Independent watchdog               selection</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IWDG_STOP</name>
                     <description>Independent watchdog counter freeze in               Stop mode</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IWDG_STDBY</name>
                     <description>Independent watchdog counter freeze in               Standby mode</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WWDG_SW</name>
                     <description>Window watchdog selection</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>nBOOT1</name>
                     <description>Boot configuration</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SRAM2_PE</name>
                     <description>SRAM2 parity check enable</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SRAM2_RST</name>
                     <description>SRAM2 Erase when system               reset</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>nSWBOOT0</name>
                     <description>Software Boot0</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>nBOOT0</name>
                     <description>nBoot0 option bit</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AGC_TRIM</name>
                     <description>Radio Automatic Gain Control               Trimming</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PCROP1ASR</name>
               <displayName>PCROP1ASR</displayName>
               <description>Flash Bank 1 PCROP Start address zone A           register</description>
               <addressOffset>0x24</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0xFFFFFE00</resetValue>
               <fields>
                  <field>
                     <name>PCROP1A_STRT</name>
                     <description>Bank 1 PCROPQ area start               offset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PCROP1AER</name>
               <displayName>PCROP1AER</displayName>
               <description>Flash Bank 1 PCROP End address zone A           register</description>
               <addressOffset>0x28</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x7FFFFE00</resetValue>
               <fields>
                  <field>
                     <name>PCROP1A_END</name>
                     <description>Bank 1 PCROP area end               offset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
                  <field>
                     <name>PCROP_RDP</name>
                     <description>PCROP area preserved when RDP level               decreased</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>WRP1AR</name>
               <displayName>WRP1AR</displayName>
               <description>Flash Bank 1 WRP area A address           register</description>
               <addressOffset>0x2C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0xFF00FF00</resetValue>
               <fields>
                  <field>
                     <name>WRP1A_STRT</name>
                     <description>Bank 1 WRP first area A start               offset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>WRP1A_END</name>
                     <description>Bank 1 WRP first area A end               offset</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>WRP1BR</name>
               <displayName>WRP1BR</displayName>
               <description>Flash Bank 1 WRP area B address           register</description>
               <addressOffset>0x30</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0xFF00FF00</resetValue>
               <fields>
                  <field>
                     <name>WRP1B_STRT</name>
                     <description>Bank 1 WRP second area B end               offset</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>WRP1B_END</name>
                     <description>Bank 1 WRP second area B start               offset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PCROP1BSR</name>
               <displayName>PCROP1BSR</displayName>
               <description>Flash Bank 1 PCROP Start address area B           register</description>
               <addressOffset>0x34</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0xFFFFFE00</resetValue>
               <fields>
                  <field>
                     <name>PCROP1B_STRT</name>
                     <description>Bank 1 PCROP area B start               offset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PCROP1BER</name>
               <displayName>PCROP1BER</displayName>
               <description>Flash Bank 1 PCROP End address area B           register</description>
               <addressOffset>0x38</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0xFFFFFE00</resetValue>
               <fields>
                  <field>
                     <name>PCROP1B_END</name>
                     <description>Bank 1 PCROP area end area B               offset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IPCCBR</name>
               <displayName>IPCCBR</displayName>
               <description>IPCC mailbox data buffer address           register</description>
               <addressOffset>0x3C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0xFFFFC000</resetValue>
               <fields>
                  <field>
                     <name>IPCCDBA</name>
                     <description>PCC mailbox data buffer base               address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>C2ACR</name>
               <displayName>C2ACR</displayName>
               <description>CPU2 cortex M0 access control           register</description>
               <addressOffset>0x5C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000600</resetValue>
               <fields>
                  <field>
                     <name>PRFTEN</name>
                     <description>CPU2 cortex M0 prefetch               enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ICEN</name>
                     <description>CPU2 cortex M0 instruction cache               enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ICRST</name>
                     <description>CPU2 cortex M0 instruction cache               reset</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PES</name>
                     <description>CPU2 cortex M0 program erase suspend               request</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>C2SR</name>
               <displayName>C2SR</displayName>
               <description>CPU2 cortex M0 status register</description>
               <addressOffset>0x60</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EOP</name>
                     <description>End of operation</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OPERR</name>
                     <description>Operation error</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PROGERR</name>
                     <description>Programming error</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WRPERR</name>
                     <description>write protection error</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PGAERR</name>
                     <description>Programming alignment               error</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SIZERR</name>
                     <description>Size error</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PGSERR</name>
                     <description>Programming sequence error</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MISSERR</name>
                     <description>Fast programming data miss               error</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FASTERR</name>
                     <description>Fast programming error</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RDERR</name>
                     <description>PCROP read error</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BSY</name>
                     <description>Busy</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CFGBSY</name>
                     <description>Programming or erase configuration               busy</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PESD</name>
                     <description>Programming or erase operation               suspended</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>C2CR</name>
               <displayName>C2CR</displayName>
               <description>CPU2 cortex M0 control           register</description>
               <addressOffset>0x64</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PG</name>
                     <description>Programming</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PER</name>
                     <description>Page erase</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MER</name>
                     <description>Masse erase</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PNB</name>
                     <description>Page Number selection</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>STRT</name>
                     <description>Start</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FSTPG</name>
                     <description>Fast programming</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EOPIE</name>
                     <description>End of operation interrupt               enable</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ERRIE</name>
                     <description>Error interrupt enable</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RDERRIE</name>
                     <description>PCROP read error interrupt               enable</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SFR</name>
               <displayName>SFR</displayName>
               <description>Secure flash start address           register</description>
               <addressOffset>0x80</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0xFFFFEE00</resetValue>
               <fields>
                  <field>
                     <name>SFSA</name>
                     <description>Secure flash start address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>DDS</name>
                     <description>Disable Cortex M0 debug               access</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FSD</name>
                     <description>Flash security disable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SRRVR</name>
               <displayName>SRRVR</displayName>
               <description>Secure SRAM2 start address and cortex M0           reset vector register</description>
               <addressOffset>0x84</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x01000000</resetValue>
               <fields>
                  <field>
                     <name>SBRV</name>
                     <description>cortex M0 access control               register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>18</bitWidth>
                  </field>
                  <field>
                     <name>SBRSA</name>
                     <description>Secure backup SRAM2a start               address</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>BRSD</name>
                     <description>backup SRAM2a security               disable</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SNBRSA</name>
                     <description>Secure non backup SRAM2a start               address</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>C2OPT</name>
                     <description>CPU2 cortex M0 boot reset vector memory               selection</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NBRSD</name>
                     <description>non-backup SRAM2b security               disable</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
