platformio/platform-ststm32/misc/svd/STM32WB55_CM4.svd
            <register>
               <name>C2AHB2ENR</name>
               <displayName>C2AHB2ENR</displayName>
               <description>CPU2 AHB2 peripheral clock enable           register</description>
               <addressOffset>0x14C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>AES1EN</name>
                     <description>CPU2 AES1 accelerator clock               enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADCEN</name>
                     <description>CPU2 ADC clock enable</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPIOHEN</name>
                     <description>CPU2 IO port H clock               enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPIOEEN</name>
                     <description>CPU2 IO port E clock               enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPIODEN</name>
                     <description>CPU2 IO port D clock               enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPIOCEN</name>
                     <description>CPU2 IO port C clock               enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPIOBEN</name>
                     <description>CPU2 IO port B clock               enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPIOAEN</name>
                     <description>CPU2 IO port A clock               enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>C2AHB3ENR</name>
               <displayName>C2AHB3ENR</displayName>
               <description>CPU2 AHB3 peripheral clock enable           register</description>
               <addressOffset>0x150</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x02080000</resetValue>
               <fields>
                  <field>
                     <name>FLASHEN</name>
                     <description>CPU2 FLASHEN</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IPCCEN</name>
                     <description>CPU2 IPCCEN</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HSEMEN</name>
                     <description>CPU2 HSEMEN</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RNGEN</name>
                     <description>CPU2 RNGEN</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AES2EN</name>
                     <description>CPU2 AES2EN</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PKAEN</name>
                     <description>CPU2 PKAEN</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>C2APB1ENR1</name>
               <displayName>C2APB1ENR1</displayName>
               <description>CPU2 APB1ENR1</description>
               <addressOffset>0x158</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000400</resetValue>
               <fields>
                  <field>
                     <name>LPTIM1EN</name>
                     <description>CPU2 Low power timer 1 clock               enable</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USBEN</name>
                     <description>CPU2 USB clock enable</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CRSEN</name>
                     <description>CPU2 CRS clock enable</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>I2C3EN</name>
                     <description>CPU2 I2C3 clock enable</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>I2C1EN</name>
                     <description>CPU2 I2C1 clock enable</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SPI2EN</name>
                     <description>CPU2 SPI2 clock enable</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RTCAPBEN</name>
                     <description>CPU2 RTC APB clock enable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LCDEN</name>
                     <description>CPU2 LCD clock enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIM2EN</name>
                     <description>CPU2 TIM2 timer clock               enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>C2APB1ENR2</name>
               <displayName>C2APB1ENR2</displayName>
               <description>CPU2 APB1 peripheral clock enable register           2</description>
               <addressOffset>0x15C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>LPTIM2EN</name>
                     <description>CPU2 LPTIM2EN</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LPUART1EN</name>
                     <description>CPU2 Low power UART 1 clock               enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>C2APB2ENR</name>
               <displayName>C2APB2ENR</displayName>
               <description>CPU2 APB2ENR</description>
               <addressOffset>0x160</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SAI1EN</name>
                     <description>CPU2 SAI1 clock enable</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIM17EN</name>
                     <description>CPU2 TIM17 timer clock               enable</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIM16EN</name>
                     <description>CPU2 TIM16 timer clock               enable</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USART1EN</name>
                     <description>CPU2 USART1clock enable</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SPI1EN</name>
                     <description>CPU2 SPI1 clock enable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIM1EN</name>
                     <description>CPU2 TIM1 timer clock               enable</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>C2APB3ENR</name>
               <displayName>C2APB3ENR</displayName>
               <description>CPU2 APB3ENR</description>
               <addressOffset>0x164</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EN802</name>
                     <description>CPU2 802.15.4 interface clock               enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BLEEN</name>
                     <description>CPU2 BLE interface clock               enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>C2AHB1SMENR</name>
               <displayName>C2AHB1SMENR</displayName>
               <description>CPU2 AHB1 peripheral clocks enable in Sleep           and Stop modes register</description>
               <addressOffset>0x168</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00011207</resetValue>
               <fields>
                  <field>
                     <name>TSCSMEN</name>
                     <description>CPU2 Touch Sensing Controller clocks               enable during Sleep and Stop modes</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CRCSMEN</name>
                     <description>CPU2 CRCSMEN</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SRAM1SMEN</name>
                     <description>SRAM1 interface clock enable during CPU1               CSleep mode</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMAMUXSMEN</name>
                     <description>CPU2 DMAMUX clocks enable during Sleep               and Stop modes</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMA2SMEN</name>
                     <description>CPU2 DMA2 clocks enable during Sleep and               Stop modes</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMA1SMEN</name>
                     <description>CPU2 DMA1 clocks enable during Sleep and               Stop modes</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>C2AHB2SMENR</name>
               <displayName>C2AHB2SMENR</displayName>
               <description>CPU2 AHB2 peripheral clocks enable in Sleep           and Stop modes register</description>
               <addressOffset>0x16C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0001209F</resetValue>
               <fields>
                  <field>
                     <name>AES1SMEN</name>
                     <description>CPU2 AES1 accelerator clocks enable               during Sleep and Stop modes</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADCFSSMEN</name>
                     <description>CPU2 ADC clocks enable during Sleep and               Stop modes</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPIOHSMEN</name>
                     <description>CPU2 IO port H clocks enable during               Sleep and Stop modes</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPIOESMEN</name>
                     <description>CPU2 IO port E clocks enable during               Sleep and Stop modes</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPIODSMEN</name>
                     <description>CPU2 IO port D clocks enable during               Sleep and Stop modes</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPIOCSMEN</name>
                     <description>CPU2 IO port C clocks enable during               Sleep and Stop modes</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPIOBSMEN</name>
                     <description>CPU2 IO port B clocks enable during               Sleep and Stop modes</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPIOASMEN</name>
                     <description>CPU2 IO port A clocks enable during               Sleep and Stop modes</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>C2AHB3SMENR</name>
               <displayName>C2AHB3SMENR</displayName>
               <description>CPU2 AHB3 peripheral clocks enable in Sleep           and Stop modes register</description>
               <addressOffset>0x170</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x03070000</resetValue>
               <fields>
                  <field>
                     <name>FLASHSMEN</name>
                     <description>Flash interface clocks enable during               CPU2 sleep modes</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SRAM2SMEN</name>
                     <description>SRAM2a and SRAM2b memory interface               clocks enable during CPU2 sleep modes</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RNGSMEN</name>
                     <description>True RNG clocks enable during CPU2 sleep               modes</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AES2SMEN</name>
                     <description>AES2 accelerator clocks enable during               CPU2 sleep modes</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PKASMEN</name>
                     <description>PKA accelerator clocks enable during               CPU2 sleep modes</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>C2APB1SMENR1</name>
               <displayName>C2APB1SMENR1</displayName>
               <description>CPU2 APB1SMENR1</description>
               <addressOffset>0x178</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x85A04601</resetValue>
               <fields>
                  <field>
                     <name>LPTIM1SMEN</name>
                     <description>Low power timer 1 clocks enable during               CPU2 Sleep mode</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USBSMEN</name>
                     <description>USB FS clocks enable during CPU2 Sleep               mode</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CRSMEN</name>
                     <description>CRS clocks enable during CPU2 Sleep               mode</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>I2C3SMEN</name>
                     <description>I2C3 clocks enable during CPU2 Sleep               mode</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>I2C1SMEN</name>
                     <description>I2C1 clocks enable during CPU2 Sleep               mode</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SPI2SMEN</name>
                     <description>SPI2 clocks enable during CPU2 Sleep               mode</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RTCAPBSMEN</name>
                     <description>RTC APB clocks enable during CPU2 Sleep               mode</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LCDSMEN</name>
                     <description>LCD clocks enable during CPU2 Sleep               mode</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIM2SMEN</name>
                     <description>TIM2 timer clocks enable during CPU2               Sleep mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>C2APB1SMENR2</name>
               <displayName>C2APB1SMENR2</displayName>
               <description>CPU2 APB1 peripheral clocks enable in Sleep           and Stop modes register 2</description>
               <addressOffset>0x17C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x000000021</resetValue>
               <fields>
                  <field>
                     <name>LPTIM2SMEN</name>
                     <description>Low power timer 2 clocks enable during               CPU2 Sleep mode</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LPUART1SMEN</name>
                     <description>Low power UART 1 clocks enable during               CPU2 Sleep mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
