platformio/platform-ststm32/misc/svd/STM32WB55_CM4.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>ADC</name>
         <description>Analog to Digital Converter instance       1</description>
         <groupName>ADC</groupName>
         <baseAddress>0x50040000</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x400</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>ADC1</name>
            <description>ADC1 global interrupt</description>
            <value>18</value>
         </interrupt>
         <registers>
            <register>
               <name>ISR</name>
               <displayName>ISR</displayName>
               <description>ADC interrupt and status           register</description>
               <addressOffset>0x0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>JQOVF</name>
                     <description>ADC group injected contexts queue               overflow flag</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AWD3</name>
                     <description>ADC analog watchdog 3 flag</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AWD2</name>
                     <description>ADC analog watchdog 2 flag</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AWD1</name>
                     <description>ADC analog watchdog 1 flag</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>JEOS</name>
                     <description>ADC group injected end of sequence               conversions flag</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>JEOC</name>
                     <description>ADC group injected end of unitary               conversion flag</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVR</name>
                     <description>ADC group regular overrun               flag</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EOS</name>
                     <description>ADC group regular end of sequence               conversions flag</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EOC</name>
                     <description>ADC group regular end of unitary               conversion flag</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EOSMP</name>
                     <description>ADC group regular end of sampling               flag</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADRDY</name>
                     <description>ADC ready flag</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IER</name>
               <displayName>IER</displayName>
               <description>ADC interrupt enable register</description>
               <addressOffset>0x4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>JQOVFIE</name>
                     <description>ADC group injected contexts queue               overflow interrupt</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AWD3IE</name>
                     <description>ADC analog watchdog 3               interrupt</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AWD2IE</name>
                     <description>ADC analog watchdog 2               interrupt</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AWD1IE</name>
                     <description>ADC analog watchdog 1               interrupt</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>JEOSIE</name>
                     <description>ADC group injected end of sequence               conversions interrupt</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>JEOCIE</name>
                     <description>ADC group injected end of unitary               conversion interrupt</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVRIE</name>
                     <description>ADC group regular overrun               interrupt</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EOSIE</name>
                     <description>ADC group regular end of sequence               conversions interrupt</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EOCIE</name>
                     <description>ADC group regular end of unitary               conversion interrupt</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EOSMPIE</name>
                     <description>ADC group regular end of sampling               interrupt</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADRDYIE</name>
                     <description>ADC ready interrupt</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CR</name>
               <displayName>CR</displayName>
               <description>ADC control register</description>
               <addressOffset>0x8</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ADCAL</name>
                     <description>ADC calibration</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADCALDIF</name>
                     <description>ADC differential mode for               calibration</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DEEPPWD</name>
                     <description>ADC deep power down enable</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADVREGEN</name>
                     <description>ADC voltage regulator               enable</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>JADSTP</name>
                     <description>ADC group injected conversion               stop</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADSTP</name>
                     <description>ADC group regular conversion               stop</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>JADSTART</name>
                     <description>ADC group injected conversion               start</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADSTART</name>
                     <description>ADC group regular conversion               start</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADDIS</name>
                     <description>ADC disable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADEN</name>
                     <description>ADC enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CFGR</name>
               <displayName>CFGR</displayName>
               <description>ADC configuration register 1</description>
               <addressOffset>0xC</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x80000000</resetValue>
               <fields>
                  <field>
                     <name>JQDIS</name>
                     <description>ADC group injected contexts queue               disable</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AWDCH1CH</name>
                     <description>ADC analog watchdog 1 monitored channel               selection</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>JAUTO</name>
                     <description>ADC group injected automatic trigger               mode</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>JAWD1EN</name>
                     <description>ADC analog watchdog 1 enable on scope               ADC group injected</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AWD1EN</name>
                     <description>ADC analog watchdog 1 enable on scope               ADC group regular</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AWD1SGL</name>
                     <description>ADC analog watchdog 1 monitoring a               single channel or all channels</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>JQM</name>
                     <description>ADC group injected contexts queue               mode</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>JDISCEN</name>
                     <description>ADC group injected sequencer               discontinuous mode</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DISCNUM</name>
                     <description>ADC group regular sequencer               discontinuous number of ranks</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>DISCEN</name>
                     <description>ADC group regular sequencer               discontinuous mode</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AUTDLY</name>
                     <description>ADC low power auto wait</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CONT</name>
                     <description>ADC group regular continuous conversion               mode</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVRMOD</name>
                     <description>ADC group regular overrun               configuration</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EXTEN</name>
                     <description>ADC group regular external trigger               polarity</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>EXTSEL</name>
                     <description>ADC group regular external trigger               source</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>ALIGN</name>
                     <description>ADC data alignement</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RES</name>
                     <description>ADC data resolution</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>DMACFG</name>
                     <description>ADC DMA transfer               configuration</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMAEN</name>
                     <description>ADC DMA transfer enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CFGR2</name>
               <displayName>CFGR2</displayName>
               <description>ADC configuration register 2</description>
               <addressOffset>0x10</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ROVSM</name>
                     <description>ADC oversampling mode managing               interlaced conversions of ADC group regular and group               injected</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TOVS</name>
                     <description>ADC oversampling discontinuous mode               (triggered mode) for ADC group regular</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVSS</name>
                     <description>ADC oversampling shift</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>OVSR</name>
                     <description>ADC oversampling ratio</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>JOVSE</name>
                     <description>ADC oversampler enable on scope ADC               group injected</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ROVSE</name>
                     <description>ADC oversampler enable on scope ADC               group regular</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SMPR1</name>
               <displayName>SMPR1</displayName>
               <description>ADC sampling time register 1</description>
               <addressOffset>0x14</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SMP9</name>
                     <description>ADC channel 9 sampling time               selection</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>SMP8</name>
                     <description>ADC channel 8 sampling time               selection</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>SMP7</name>
                     <description>ADC channel 7 sampling time               selection</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>SMP6</name>
                     <description>ADC channel 6 sampling time               selection</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>SMP5</name>
                     <description>ADC channel 5 sampling time               selection</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>SMP4</name>
                     <description>ADC channel 4 sampling time               selection</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>SMP3</name>
                     <description>ADC channel 3 sampling time               selection</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>SMP2</name>
                     <description>ADC channel 2 sampling time               selection</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>SMP1</name>
                     <description>ADC channel 1 sampling time               selection</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
