platformio/platform-ststm32/misc/svd/STM32WB55_CM4.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>PKA</name>
         <description>PKA</description>
         <groupName>PKA</groupName>
         <baseAddress>0x58002000</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x2000</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>PKA</name>
            <description>Private key accelerator
        interrupt</description>
            <value>29</value>
         </interrupt>
         <registers>
            <register>
               <name>CR</name>
               <displayName>CR</displayName>
               <description>Control register</description>
               <addressOffset>0x0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ADDRERRIE</name>
                     <description>Address error interrupt               enable</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RAMERRIE</name>
                     <description>RAM error interrupt enable</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PROCENDIE</name>
                     <description>End of operation interrupt               enable</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MODE</name>
                     <description>PKA Operation Mode</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>SECLVL</name>
                     <description>Security Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>START</name>
                     <description>Start the operation</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EN</name>
                     <description>Peripheral Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SR</name>
               <displayName>SR</displayName>
               <description>PKA status register</description>
               <addressOffset>0x4</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ADDRERRF</name>
                     <description>Address error flag</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RAMERRF</name>
                     <description>RAM error flag</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PROCENDF</name>
                     <description>PKA End of Operation flag</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BUSY</name>
                     <description>PKA Operation in progress</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CLRFR</name>
               <displayName>CLRFR</displayName>
               <description>PKA clear flag register</description>
               <addressOffset>0x8</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ADDRERRFC</name>
                     <description>Clear Address error flag</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RAMERRFC</name>
                     <description>Clear RAM error flag</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PROCENDFC</name>
                     <description>Clear PKA End of Operation               flag</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>VERR</name>
               <displayName>VERR</displayName>
               <description>PKA version register</description>
               <addressOffset>0x1FF4</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000010</resetValue>
               <fields>
                  <field>
                     <name>MINREV</name>
                     <description>Minor revision</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>MAJREV</name>
                     <description>Major revision</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IPIDR</name>
               <displayName>IPIDR</displayName>
               <description>PKA identification register</description>
               <addressOffset>0x1FF8</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00170061</resetValue>
               <fields>
                  <field>
                     <name>ID</name>
                     <description>Identification Code</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SIDR</name>
               <displayName>SIDR</displayName>
               <description>PKA size ID register</description>
               <addressOffset>0x1FFC</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0xA3C5DD08</resetValue>
               <fields>
                  <field>
                     <name>SID</name>
                     <description>Side Identification Code</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
